org/content.org
#+HUGO_SECTION: ./
#+HUGO_BASE_DIR: ../

#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t

** DONE Hello World!
CLOSED: [2020-09-22 Tue 12:00]
:PROPERTIES:
:EXPORT_FILE_NAME: hello-world
:END:

I have been interested in putting up my own website for some time, and
I've finally decided to make it happen. The coronavirus pandemic (I've
seen it referred to in one news article as "the ongoing global
situation") has offered me more time than expected to work on personal
projects, so I have been assembling this site for the last several
days. In this post, I briefly discuss my motivations and goals.
<!--more-->

*** My Intent
This site was conceived as a place to share my personal portfolio of
projects with friends, colleagues, and potential employers. The
resources comprising each project are stored in a repository on
GitHub, which this site links to. Eventually, I will create additional
pages on this site to showcase my work.

Each of the projects that interest me most, present or future, will
have their own showcase pages featuring explanations, diagrams, and
image galleries. Projects intended to be broadly useful to others will
also have documentation explaining features, specifications, and a
roadmap for future development.

*** This Blog
A primary motivation to create my own site is my interest in writing
about technology and engineering. Writing is a fantastic way to
organize and reconsider thoughts about a topic, and to gain new
insights. I have many exciting projects in the pipeline, almost all of
which I intend to write about in this blog.

My posts will focus on engineering problems that are interesting to
me; I will strive to make them interesting for any future readers of
this blog as well. I want to work from first principles, solve
difficult problems, and make things that help people. If all goes to
plan, my writings here will chronicle that work.

*** What Else
Check out my [[*Projects][projects]]! There are some really cool
things there. Or perhaps you would like to learn more [[*About][about
me]]. If you would like to contact me, use the link below. Thank you
for reading.


